 //? פונקציה שמקבלת שני מספרים ומחזירה את הגדול מבינהם
 function maxOfTwo() {
    //? בקשת המספר הראשון מהמשתמש
    let a = prompt("הכנס את המספר הראשון:");
    //? המרת המספר הראשון למספר שלם
    a = parseInt(a);
    //? בדיקה אם המספר הראשון הוא מספר שלם חוקי
    if (isNaN(a)) {
        alert("תפסיק לכתוב שטויות,תכניס מספר.");
        return;
    }

    //? בקשת המספר השני מהמשתמש
    let b = prompt("הכנס את המספר השני:");
    //? המרת המספר השני למספר שלם
    b = parseInt(b);
    //? בדיקה אם המספר השני הוא מספר שלם חוקי
    if (isNaN(b)) {
        alert("תפסיק לכתוב שטויות,תכניס מספר.");
        return;
    }

    //? בדיקה איזה מספר גדול יותר
    if (a > b) {
        //? אם a גדול יותר מ- b
        return a;
    } else {
        //? אם b גדול יותר מ- a
        return b;
    }
}

//? maxOfTwo קריאה לפונקציה 
let result = maxOfTwo();
//? alert הצגת התוצאה באלמנט 
alert(`${'המספר הגבוה הוא'} ` + result);