let numbers = prompt("היי,מה המצב,תכניס כמה מספרים שבא לך כדי לחשב ממוצע,אל תשכח להפריד בניהם עם  , ").split(","); //? מקבל מספרים מהמשתמש ומפצל אותם למערך של תת-מחרוזות על פי המפריד ","
        let sum = 0; //? משתנה לחישוב הסכום
        for (let i = 0; i < numbers.length; i++) { //? לולאה שעוברת על כל המספרים במערך
            sum += parseInt(numbers[i]); //? מוסיף את המספר הנוכחי לסכום,משתמש בפונקציה פרסינט על מנת להמיר את המחרוזת למספר
        }
        let average = sum / numbers.length; //? מחשב את הממוצע ע"י חילוק הסכום במספר המספרים
        document.querySelector("#result").innerHTML = "הממוצע הוא: " + average; //? מציג את התוצאה באלמנט עם ה-id "result"